# Project 1 Midterm Zoe Averill

## Import the necessary libraries

In [1]:
import os
import numpy
import pandas as pd
import json
import pymongo
from sqlalchemy import create_engine

## Declare and assign connection variables for the MySQL server and databases

In [2]:
host_name = "localhost"
host_ip = "127.0.0.1"
port = "3306"
user_id = "root"
pwd = "Passw0rd123"

src_dbname = "sakila"
dst_dbname = "sakila_p"

import pymongo
from sqlalchemy import create_engine

mysql_uid = "root"
mysql_pwd = "Passw0rd123"

atlas_cluster_name = "sandbox.zibbf"
atlas_user_name = "m001-student"
atlas_password = "m001-mongodb-basics"

conn_str_m = {"local" : f"mongodb://localhost:27017/",
    "atlas" : f"mongodb+srv://{atlas_user_name}:{atlas_password}@{atlas_cluster_name}.mongodb.net"
}

print(f"Local Connection String: {conn_str_m['local']}")

Local Connection String: mongodb://localhost:27017/

## Define functions for getting data from and setting data into databases

In [3]:
def get_sql_dataframe(user_id, pwd, db_name, sql_query):
    '''Create a connection to the MySQL database'''
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@localhost/{db_name}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    
    '''Invoke the pd.read_sql() function to query the database, and fill a Pandas DataFrame.'''
    conn = sqlEngine.connect()
    dframe = pd.read_sql(sql_query, conn);
    conn.close()
    
    return dframe


def get_mongo_dataframe(connect_str, db_name, collection, query):
    '''Create a connection to MongoDB'''
    client = pymongo.MongoClient(connect_str)
    
    '''Query MongoDB, and fill a python list with documents to create a DataFrame'''
    db = client[db_name]
    dframe = pd.DataFrame(list(db[collection].find(query)))
    dframe.drop(['_id'], axis=1, inplace=True)
    client.close()
    return dframe


    
    
def get_dataframe(user_id, pwd, host_name, db_name, sql_query):
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}/{db_name}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    connection = sqlEngine.connect()
    dframe = pd.read_sql(sql_query, connection);
    connection.close()
    
    return dframe


def set_dataframe(user_id, pwd, host_name, db_name, df, table_name, pk_column, db_operation):
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}/{db_name}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    connection = sqlEngine.connect()
    
    if db_operation == "insert":
        df.to_sql(table_name, con=connection, index=False, if_exists='replace')
        sqlEngine.execute(f"ALTER TABLE {table_name} ADD PRIMARY KEY ({pk_column});")
            
    elif db_operation == "update":
        df.to_sql(table_name, con=connection, index=False, if_exists='append')
    
    connection.close()

## Create the new data warehouse database and switch connection context
Drop database if it already exists, and create the new one to be used subsequently

In [4]:
conn_str = f"mysql+pymysql://{'root'}:{'Passw0rd123'}@{'localhost'}"
sqlEngine = create_engine(conn_str, pool_recycle=3600)

sqlEngine.execute(f"DROP DATABASE IF EXISTS `{'sakila_p'}`;")
sqlEngine.execute(f"CREATE DATABASE `{'sakila_p'}`;")
sqlEngine.execute(f"USE {'sakila_p'};")

## Create and populate the dimension tables
### Staff dimension table
Extracting the data

In [5]:
sql_staff = "SELECT * FROM sakila.staff;"
df_staff = get_dataframe(user_id, pwd, host_name, src_dbname, sql_staff)
df_staff.head()

,staff_id,first_name,last_name,address_id,picture,email,store_id,active,username,password,last_update
0,1,Mike,Hillyer,3,b'\x89PNG\r\n\x1a\n\x00\x00\x00\rIHDR\x00\x00\...,Mike.Hillyer@sakilastaff.com,1,1,Mike,8cb2237d0679ca88db6464eac60da96345513964,2006-02-15 03:57:16
1,2,Jon,Stephens,4,None,Jon.Stephens@sakilastaff.com,2,1,Jon,None,2006-02-15 03:57:16

### Necessary transformations
Remove unnecessary columns, BLOB columns, change column names

In [6]:
df_staff.drop(['picture', 'password', 'last_update'], axis=1, inplace=True)
df_staff.rename(columns={'staff_id': 'staff_key', 'address_id': 'address_key', 'store_id': 'store_key'}, inplace=True)
df_staff.head(2)

,staff_key,first_name,last_name,address_key,email,store_key,active,username
0,1,Mike,Hillyer,3,Mike.Hillyer@sakilastaff.com,1,1,Mike
1,2,Jon,Stephens,4,Jon.Stephens@sakilastaff.com,2,1,Jon

### Load dataFrame into the new data warehouse by creating new table
Create the dimension table by setting the dataframe using the desired table name, dataframe to populate the table, and the primary key

In [7]:
db_operation = "insert"

tables = [('dim_staff', df_staff, 'staff_key')]
for table_name, dataframe, primary_key in tables:
    set_dataframe(user_id, pwd, host_name, dst_dbname, dataframe, table_name, primary_key, db_operation)

## Customer dimension table
### Load in Customer CSV file from file system
Include error handling for loading in CSV data

In [8]:
def get_csvfile(data):
    #read_file = file(pd.read_csv('rf', header=None, index_col=None, sep= '\t'))
    try:
        global df_customers
        df_customers = pd.read_csv(data ,header=None, index_col=None, sep= '\t')
    except Exception as err:
        print('This is an error: ' + str(err))

get_csvfile('C:\\ProgramData\\MySQL\\MySQL Server 8.0\\Uploads\\customers.csv')
df_customers.head(3)

,0,1,2,3,4,5,6,7,8
0,1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,5,1,2006-02-14 22:04:36,2006-02-15 04:57:20
1,2,1,PATRICIA,JOHNSON,PATRICIA.JOHNSON@sakilacustomer.org,6,1,2006-02-14 22:04:36,2006-02-15 04:57:20
2,3,1,LINDA,WILLIAMS,LINDA.WILLIAMS@sakilacustomer.org,7,1,2006-02-14 22:04:36,2006-02-15 04:57:20

### Necessary transformations
Drop columns, rename columns

In [9]:
df_customers.drop(6, axis=1, inplace=True)
df_customers = df_customers.rename(columns={0:'customer_key', 1: 'store_key', 2: 'first_name',
                                            3:'last_name', 4: 'email', 5: 'address_key', 7: 'create_date', 8: 'last_update' })

### Load dataframe into new datawarehouse by creating table

In [10]:
dataframe = df_customers
table_name = 'dim_customers'
primary_key = 'customer_key'
db_operation = "insert"

set_dataframe(user_id, pwd, host_name, dst_dbname, dataframe, table_name, primary_key, db_operation)

### Verify creation of customer table from CSV data

In [11]:
sql_customers = "SELECT * FROM  sakila_p.dim_customers;"
df_dim_customers = get_sql_dataframe(mysql_uid, mysql_pwd, dst_dbname, sql_customers)
df_dim_customers.head(2)

,customer_key,store_key,first_name,last_name,email,address_key,create_date,last_update
0,1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,5,2006-02-14 22:04:36,2006-02-15 04:57:20
1,2,1,PATRICIA,JOHNSON,PATRICIA.JOHNSON@sakilacustomer.org,6,2006-02-14 22:04:36,2006-02-15 04:57:20

## Create fact table

### Extract rental data for fact table

In [12]:
sql_rentals = "SELECT * FROM sakila.rental;"
df_rentals = get_dataframe('root', 'Passw0rd123', 'localhost', 'sakila', sql_rentals)
df_rentals.rename(columns={'rental_id':'rental_key', 'inventory_id': 'inventory_key', 'customer_id': 'customer_key', 'staff_id': 'staff_key'}, inplace=True)
df_rentals.head()

,rental_key,rental_date,inventory_key,customer_key,return_date,staff_key,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

### Get inventory data to add to fact table
### Populate MongoDB with source inventory data

In [13]:
client = pymongo.MongoClient(conn_str_m['local'])
db = client[src_dbname]

# Gets the path of the Current Working Directory for this Notebook, and then Appends the 'Project1_Data' directory.
data_dir = os.path.join(os.getcwd(), 'Project1_Data')

json_files = {"inventory" : 'sakila_inventoryp.json'
             }

for file in json_files:
    db.drop_collection(file)
    json_file = os.path.join(data_dir, json_files[file])
    with open(json_file, 'r') as openfile:
        json_object = json.load(openfile)
        file = db[file]
        result = file.insert_many(json_object)
        #print(f"{file} was successfully loaded.")
        
client.close()

### Extract inventory data from MongoDB
Include error handling for loading in data

In [14]:
query = {}
collection = "inventory"

def get_jsonfile(collection):
    try:
        global df_inventory
        df_inventory = get_mongo_dataframe(conn_str_m['local'], src_dbname, collection, query)
        return(df_inventory.head())
    except Exception as err:
        print('This is an error: ' + str(err))

get_jsonfile('inventory')
df_inventory.head(3)

   inventory_id  film_id  store_id          last_update
0             1        1         1  2006-02-15 05:09:17
1             2        1         1  2006-02-15 05:09:17
2             3        1         1  2006-02-15 05:09:17

### Necessary transformations
Drop and rename columns

In [15]:
df_inventory.drop('last_update', axis=1, inplace=True)
df_inventory.rename(columns={'inventory_id': 'inventory_key', 'film_id': 'film_key', 'store_id': 'store_key'}, inplace=True)
df_inventory.head()

   inventory_key  film_key  store_key
0              1         1          1
1              2         1          1
2              3         1          1
3              4         1          1
4              5         1          2

### Merge inventory data with rental data

In [16]:
df_rentals = pd.merge(df_rentals, df_inventory, on ='inventory_key', how='inner')
df_rentals.head()

,rental_key,rental_date,inventory_key,customer_key,return_date,staff_key,last_update,film_key,store_key
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53,80,1
1,1577,2005-06-16 04:03:28,367,327,2005-06-24 22:40:28,2,2006-02-15 21:30:53,80,1
2,3584,2005-07-06 04:16:43,367,207,2005-07-13 07:08:43,1,2006-02-15 21:30:53,80,1
3,10507,2005-08-01 11:22:20,367,45,2005-08-04 13:18:20,2,2006-02-15 21:30:53,80,1
4,13641,2005-08-20 07:34:42,367,281,2005-08-26 05:18:42,1,2006-02-15 21:30:53,80,1

### Reorder columns

In [17]:
df_fact_rentals = df_rentals

ordered_columns = ['rental_key', 'inventory_key', 'customer_key', 'staff_key',
        'film_key', 'store_key', 'rental_date', 'return_date', 'last_update']
df_fact_rentals = df_fact_rentals[ordered_columns]

df_fact_rentals.head(5)

,rental_key,inventory_key,customer_key,staff_key,film_key,store_key,rental_date,return_date,last_update
0,1,367,130,1,80,1,2005-05-24 22:53:30,2005-05-26 22:04:30,2006-02-15 21:30:53
1,1577,367,327,2,80,1,2005-06-16 04:03:28,2005-06-24 22:40:28,2006-02-15 21:30:53
2,3584,367,207,1,80,1,2005-07-06 04:16:43,2005-07-13 07:08:43,2006-02-15 21:30:53
3,10507,367,45,2,80,1,2005-08-01 11:22:20,2005-08-04 13:18:20,2006-02-15 21:30:53
4,13641,367,281,1,80,1,2005-08-20 07:34:42,2005-08-26 05:18:42,2006-02-15 21:30:53

### Remove timestamp from date columns
So they can later be merged on the date_key, repeat on rental_date, return_date, and last_update

In [18]:
df_fact_rentals['rental_date'] = [x[:-9] for x in df_fact_rentals['rental_date'].astype(str)]
df_fact_rentals['return_date'] = [x[:-9] for x in df_fact_rentals['return_date'].astype(str)]
df_fact_rentals['last_update'] = [x[:-9] for x in df_fact_rentals['last_update'].astype(str)]
df_fact_rentals.head()

,rental_key,inventory_key,customer_key,staff_key,film_key,store_key,rental_date,return_date,last_update
0,1,367,130,1,80,1,2005-05-24,2005-05-26,2006-02-15
1,1577,367,327,2,80,1,2005-06-16,2005-06-24,2006-02-15
2,3584,367,207,1,80,1,2005-07-06,2005-07-13,2006-02-15
3,10507,367,45,2,80,1,2005-08-01,2005-08-04,2006-02-15
4,13641,367,281,1,80,1,2005-08-20,2005-08-26,2006-02-15

### Convert date columns back to datetime

In [19]:
# rental_date column
df_fact_rentals['rental_date'] = pd.to_datetime(df_fact_rentals['rental_date'])
df_fact_rentals['rental_date'] = df_fact_rentals['rental_date'].dt.normalize()
df_fact_rentals['rental_date'] = df_fact_rentals['rental_date'].dt.floor('D')

# return_date column
df_fact_rentals['return_date'] = pd.to_datetime(df_fact_rentals['return_date'])
df_fact_rentals['return_date'] = df_fact_rentals['return_date'].dt.normalize()
df_fact_rentals['return_date'] = df_fact_rentals['return_date'].dt.floor('D')

# last_update column
df_fact_rentals['last_update'] = pd.to_datetime(df_fact_rentals['last_update'])
df_fact_rentals['last_update'] = df_fact_rentals['last_update'].dt.normalize()
df_fact_rentals['last_update'] = df_fact_rentals['last_update'].dt.floor('D')

## Load fact table into datawarehouse sakila_p

In [20]:
table_name = 'fact_rentals'
primary_key = 'rental_key'
operation = 'insert'
set_dataframe(user_id, pwd, host_name, dst_dbname, df_fact_rentals, table_name, primary_key, operation)

# Get the data from the Date Dimension Table 
Get the surrogate and business key from the date dimension table with the get_dataframe function. Then cast the business key (full_date column) to datetime64

In [21]:
sql_dim_date = "SELECT date_key, full_date FROM sakila_p.dim_date;"
df_dim_date = get_dataframe(user_id, pwd, host_name, src_dbname, sql_dim_date)
df_dim_date.full_date = df_dim_date.full_date.astype('datetime64')
df_dim_date.head()

ProgrammingError: (pymysql.err.ProgrammingError) (1146, "Table 'sakila_p.dim_date' doesn't exist")
[SQL: SELECT date_key, full_date FROM sakila_p.dim_date;]
(Background on this error at: https://sqlalche.me/e/14/f405)

## Lookup the datekeys that correspend to each date column
rental_date column, return_date column, and last_update column

### rental_date column

In [ ]:
df_dim_rental_date = df_dim_date.rename(columns={"date_key" : "rental_date_key", "full_date" : "rental_date"})
df_fact_rentals = pd.merge(df_fact_rentals, df_dim_rental_date, on='rental_date', how='inner')
df_fact_rentals.drop(['rental_date'], axis=1, inplace=True)
df_fact_rentals.head(2)

### return_date column

In [ ]:
df_dim_return_date = df_dim_date.rename(columns={"date_key" : "return_date_key", "full_date" : "return_date"})
df_fact_rentals = pd.merge(df_fact_rentals, df_dim_return_date, on='return_date', how='inner')
df_fact_rentals.drop(['return_date'], axis=1, inplace=True)
df_fact_rentals.head(2)

### last_update column

In [ ]:
df_dim_last_update = df_dim_date.rename(columns={"date_key" : "last_update_key", "full_date" : "last_update"})
df_fact_rentals = pd.merge(df_fact_rentals, df_dim_last_update, on='last_update', how='inner')
df_fact_rentals.drop(['last_update'], axis=1, inplace=True)
df_fact_rentals.head(2)

## Write fact table back to the datawarehouse

In [ ]:
table_name = 'fact_rentals'
primary_key = 'rental_key'
operation = 'insert'
set_dataframe(user_id, pwd, host_name, dst_dbname, df_fact_rentals, table_name, primary_key, operation)

## Author SELECT statements to confirm creation of fact table

### Select statement using customer dimension

In [ ]:
sql_test = '''
    SELECT customer.`last_name`
    FROM sakila_p.`fact_rentals` AS rentals
    INNER JOIN sakila_p.`dim_customers` AS customer
    ON rentals.customer_key = customer.customer_key
'''.format(dst_dbname)
df_test = get_dataframe(user_id, pwd, host_name, src_dbname, sql_test)
df_test.head()

### Select statement using staff dimension

In [ ]:
sql_test = '''
    SELECT staff.`last_name`,
        COUNT(rentals.`staff_key`) AS `count_staff_key`
    FROM sakila_p.`fact_rentals` AS rentals
    INNER JOIN sakila_p.`dim_staff` AS staff
    ON rentals.staff_key = staff.staff_key
    GROUP BY staff.`last_name`
    ORDER BY count_staff_key DESC;
'''.format(dst_dbname)
df_test = get_dataframe(user_id, pwd, host_name, src_dbname, sql_test)
df_test.head()